//===================================================================================================================
let ballTop; 
//====================================================================================================================
function moveHandler(){
    $("#ball").animate({
        left: "+=50px",
        top:"+=50px",
        width:"+=20px",
        height:"+=20px"
        
    })
}
//====================================================================================================================
function gid(id){
    return document.getElementById(id);
}
//====================================================================================================================
$(document).ready(function(){
    //이벤트 핸들러를 해당객체에 연결한다 . 
    //div 태그 의 스타일 속성 top의 값을 alert 로 확인한다. 
    ballTop = $("#ball").css("top")//balltop전역변수에 백업받는다 

    // gid("printer").addEventListener("click",function(){
    //     gid("ball").innerHTML = "jQuery"
    // })
    $("#printer").click(function(){
        $("#ball").html("jquery")
    })


    $("#move").click(moveHandler);
    $("#reset").click(function(){
        $("#ball").animate({
            left:"8px",
            top:ballTop,
            width: "50px",
            height:"50px"
        })
    })
})
//====================================================================================================================

